spaxxomatic/esp8266_iot_node/src/mqtt_sensor_actor.cpp
#define NO_GLOBAL_HTTPUPDATE
//#define DEBUG_ESP_HTTP_CLIENT
// #define DEBUG_ESP_UPDATER
//#define DEBUG_ESP_HTTP_UPDATE
//#define DEBUG_ESP_HTTP_CLIENT
// #define DEBUG_ESP_PORT Serial

#include "debug.h"
#include <Arduino.h>

#include <DNSServer.h>
#include <ESP8266WiFi.h>
#include <WiFiClient.h>
#include <ESP8266WebServer.h>
#include <EEPROM.h>
#include <ArduinoJson.h>
#include "config.h"
#include "version.h"
#include "eeprom_settings.h"
#include <AsyncMqttClient.h>
#include <ESP8266HTTPClient.h>
#include <ESP8266httpUpdate.h>

#include <Ticker.h>
Ticker blinker;

#define FORCE_DEEPSLEEP

extern "C" {
#include "user_interface.h"
}
#include "cmd.h"


#define MQTT_ERROR_COUNT_WIFI_RESET 10

uint8_t cnt_mqtt_connectionerror = 0; //counts various errors during operations. If the counter exceeds a certain value, the  wifi will be reset. This is a workaround for the unreliable WiFI.state and wifi event signaling

#define INCR_MQTT_CONN_ERROR cnt_mqtt_connectionerror++

#define RST_MQTT_CONN_ERROR cnt_mqtt_connectionerror = 0

os_timer_t ioHandlerTimer;

bool ioHandlerTick;
bool f_SendConfigReport;

//timer for periodocally reading IO's
void ioTimerCallback(void *pArg) {
      ioHandlerTick = true;
}

IPAddress mqttServerIp;
char* mqttUsername;
char* mqttPassword;
AsyncMqttClient mqttClient;

HTTPClient http;

#ifdef HAS_DHT_SENSOR
DHT dht(DHTPIN, DHTTYPE);
#endif
#ifdef HAS_BUTTON
uint8_t iButtonState = 0;
#endif
#ifdef HAS_MOTION_SENSOR
uint8_t cnt_motion_sensor_countdown=0xFF;
#endif
unsigned int batt;
#define MODE_SENSOR_DISABLED 'D'
#define MODE_SENSOR_ENABLED 1
#define FW_UPLOAD_PORT 9999
unsigned int sensorMode = MODE_SENSOR_ENABLED;
int pwmdir = 0;
double battV;

void httpUpdate();

enum SEM_STATE {
  SEM_BUFF_FREE,
  SEM_BUFF_READING,
  SEM_BUFF_WRITING, 
  SEM_BUFF_AWAITPROCESS
};
volatile uint8_t sem_lock_tempReceivePayloadBuffer = SEM_BUFF_FREE;

enum AUTOCONF_STATE {
  AUTOCONF_DISABLED,
  AUTOCONF_START,
  AUTOCONF_CONNECT_WIFI,  
  AUTOCONF_WIFI_CONNECTED, 
  AUTOCONF_GET_CONFIG,
  AUTOCONF_GET_CONFIG_PROGRESS, 
  AUTOCONF_GET_CONFIG_ERROR,
  AUTOCONF_CONFIG_STORED,
};

volatile uint8_t state_autoconfig_mode = AUTOCONF_DISABLED;

volatile bool f_mqtt_reconnect=false;
volatile bool f_subscribe=false;
volatile bool f_processConfig=false;
volatile bool f_deleteRemoteConfig=false;
volatile bool f_handleActorEvent=false;

#define MAX_JSON_MSG_LEN 255
StaticJsonBuffer<MAX_JSON_MSG_LEN> jsonBuffer;

char tempSendPayloadBuffer[256];
char tempReceivePayloadBuffer[MAX_JSON_MSG_LEN + 1];
char tempTopicBuffer[128];

ADC_MODE(ADC_VCC);

char str_mac[16] ;

void connectToWifi();
/*Wifi reconnection handling*/
Ticker timer_wifiReconnect;
#define START_WIFI_CONNCHECK_TIMER if (!timer_wifiReconnect.active()){timer_wifiReconnect.attach(4, connectToWifi);}
#define STOP_WIFI_CONNCHECK_TIMER timer_wifiReconnect.detach()

WiFiEventHandler wifiConnectHandler;
WiFiEventHandler wifiDisconnectHandler;

Ticker timer_getConfigConnstr;
#define TRIGGER_GET_CONFIG_CONNSTR if (!timer_getConfigConnstr.active()){ timer_getConfigConnstr.once(2, trigger_get_connstr);}
#define STOP_GET_CONFIG_CONNSTR timer_getConfigConnstr.detach()

void trigger_get_connstr(){
  state_autoconfig_mode = AUTOCONF_GET_CONFIG;
}
/******************* WIFI STATE BUG WORKAROUNDS ************/



void resetWiFi() {
  SERIAL_DEBUG("Wifi reset");
  #if defined(ESP32)
  WiFi.disconnect();
  #else // if defined(ESP32)
  ETS_UART_INTR_DISABLE();
  wifi_station_disconnect();
  ETS_UART_INTR_ENABLE();
  #endif // if defined(ESP32)();
  
  WiFi.mode(WIFI_OFF);  
  WiFi.forceSleepBegin();
  delay(1);
  WiFi.forceSleepWake();
  WiFi.mode(WIFI_STA);  
  delay(1);
  SERIAL_DEBUG("Wifi reset ok");
}

/*******************END WIFI STATE BUG WORKAROUNDS ************/

void onWifiConnect(const WiFiEventStationModeGotIP& event);
void onWifiDisconnect(const WiFiEventStationModeDisconnected& event);

void mqtt_check_conn();


#define BLINK_ERROR if (!blinker.active()) {blinker.attach(0.1, flip);}
#define BLINK_STARTING blinker.attach(0.5, flip);
#define BLINK_STOP blinker.detach();

void flip() {  
  digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));     // set pin to the opposite state
}

volatile boolean bSendHeartbeat = false;
void timer_heartbeat_handler(){
  bSendHeartbeat = true;
}

void timer_mqttConnCheck_handler(){
if (!mqttClient.connected()){
  //we do not call here reconnect, since we're in a timer routine and it must exit before any yield is called
  f_mqtt_reconnect = true; //trigger reconnection in main thread  
}
}

void enterConfigWifi(){
  // connect to a hardcoded AP and load configuration from a config service
  
  if (state_autoconfig_mode >= AUTOCONF_CONNECT_WIFI) return;
  
  state_autoconfig_mode = AUTOCONF_CONNECT_WIFI;
  
  BLINK_STOP; BLINK_ERROR;    
  START_WIFI_CONNCHECK_TIMER;
  
  Serial.println("Connecting to autoconf wifi");
  
}

void exitConfigWifi(){
  state_autoconfig_mode = AUTOCONF_DISABLED;
}

#define MSG_UPD_VERSION_EXISTS "Upd skip, same fw version"
#define MSG_UPD_VERSION_NOTFOUND "HTTP_UPDATE_NO_UPDATES"
#define MSG_HTTP_UPDATE_OK "HTTP_UPDATE_OK"
void httpUpdate(){  
  if (EepromConfig.get_http_update_flag() == EEPROOM_HTTP_UPDATE_STARTED){  // a previous run has been ran and a reboot occured 
    EepromConfig.set_http_update_flag(EEPROOM_HTTP_UPDATE_SUCCESS);
    return;
  }    
  if (EepromConfig.get_http_update_flag() == EEPROOM_HTTP_UPDATE_DO_ON_REBOOT){      
    ESP8266HTTPUpdate ESPhttpUpdate;    
    char* server_ip = EepromConfig.settings.mqtt_server;
    uint16_t update_fw_ver = EepromConfig.settings.update_fw_ver;
    if (update_fw_ver == FW_VERSION){
      SERIAL_DEBUGC(MSG_UPD_VERSION_EXISTS);       
      SERIAL_DEBUG(update_fw_ver);
      EepromConfig.set_http_update_flag(EEPROOM_HTTP_NO_UPDATE_FOUND);
      EepromConfig.store_lasterr(MSG_UPD_VERSION_EXISTS);
      return; 
    }

    //snprintf(tempSendPayloadBuffer, sizeof(tempSendPayloadBuffer),  "http://%s:%i/%d.bin", server_ip, FW_UPLOAD_PORT, update_fw_ver); //misusing the tempSendPayloadBuffer to store the url
    snprintf(tempSendPayloadBuffer, sizeof(tempSendPayloadBuffer),  "%d.bin", update_fw_ver); //misusing the tempSendPayloadBuffer to store the url
    EepromConfig.set_http_update_flag(EEPROOM_HTTP_UPDATE_STARTED);
    ESPhttpUpdate.rebootOnUpdate(false);
    ESP.wdtDisable();
    SERIAL_DEBUGC("Start httpUpdate from ");
    SERIAL_DEBUG(tempSendPayloadBuffer);
        
