spaxxomatic/esp8266_iot_node/src/mqtt_sensor_actor.cpp
    //t_httpUpdate_return ret = ESPhttpUpdate.update(tempSendPayloadBuffer); //Location of your binary file      
    t_httpUpdate_return ret = ESPhttpUpdate.update(server_ip, FW_UPLOAD_PORT, tempSendPayloadBuffer, String(FW_VERSION)); 
    //t_httpUpdate_return ret = ESPhttpUpdate.update(tempSendPayloadBuffer, FW_VERSION); 
    switch (ret) {
      case HTTP_UPDATE_FAILED:
        Serial.printf("HTTP_UPDATE_FAIL Error (%d): %s", ESPhttpUpdate.getLastError(), ESPhttpUpdate.getLastErrorString().c_str());
        EepromConfig.set_http_update_flag(EEPROOM_HTTP_UPDATE_FAILED);
        break;
      case HTTP_UPDATE_NO_UPDATES:
        Serial.println("HTTP_UPDATE_NO_UPDATES");
        EepromConfig.set_http_update_flag(EEPROOM_HTTP_NO_UPDATE_FOUND);      
        EepromConfig.store_lasterr(MSG_UPD_VERSION_NOTFOUND);
        break;
      case HTTP_UPDATE_OK:
        Serial.println(MSG_HTTP_UPDATE_OK);
        EepromConfig.set_http_update_flag(EEPROOM_HTTP_UPDATE_SUCCESS);
        //EepromConfig.store_lasterr(MSG_HTTP_UPDATE_OK);
        esp_bugfree_restart();
        break;
      default:
        EepromConfig.set_http_update_flag(EEPROOM_HTTP_UPDATE_FAILED);
    }
  }
}

char actor_topic[32] ;
char config_topic[32];
char report_topic[32];
char sensor_topic[32];

volatile uint pwmval = 1;

volatile bool sendActorState = false;
Ticker timer_light_on;

void set_actor(){
    pwmval = 1024; 
    digitalWrite(ACTOR_PIN, EepromConfig.settings.actor_state );
    //digitalWrite(SONOFF_LED, !EepromConfig.settings.actor_state );
    sendActorState = true;
}

void actor_off(){
    EepromConfig.settings.actor_state = 0;
    set_actor();
}

void actor_on(bool permanent_on_disable_timer){
    EepromConfig.settings.actor_state = 1;
    set_actor();
    #ifdef HAS_MOTION_SENSOR
    if (! permanent_on_disable_timer)
      timer_light_on.once(float(EepromConfig.settings.motion_sensor_off_timer), actor_off);
    #endif  
}

void actor_toggle(){
    EepromConfig.settings.actor_state = !EepromConfig.settings.actor_state;
    set_actor();
}

Ticker timer_heartbeat;
Ticker timer_mqttConnCheck;

#define ENABLE_MQTT_CHECK_TIMER if (!timer_mqttConnCheck.active()) timer_mqttConnCheck.attach(5, timer_mqttConnCheck_handler)
#define DISABLE_MQTT_CHECK_TIMER timer_mqttConnCheck.detach();

#ifdef HAS_MOTION_SENSOR

void motion_sensor_irq() {
    if (sensorMode != MODE_SENSOR_DISABLED) {
          actor_on(false);
    }
}
#endif

void handleActorMsg(char* payload, int length);
void handleSubscribe();
bool handleConfigMsg();

void onMqttMessage(char* topic, char* payload, AsyncMqttClientMessageProperties properties, size_t len, size_t index, size_t total) {
  SERIAL_DEBUGC("*RX pub: ");
  SERIAL_DEBUG(topic);
  RST_MQTT_CONN_ERROR;
  if (len>0){
    if (strcmp(topic, config_topic) == 0){      
      //the payload needs to be processed asyncronously since the processing might block too long 
      //so we copy the payload to a buffer and signal the further processing via the sem_lock_tempReceivePayloadBuffer
      if (len >= MAX_JSON_MSG_LEN){
        SERIAL_DEBUG(" !payld > cap");
        return ;
      }

      if (sem_lock_tempReceivePayloadBuffer != SEM_BUFF_FREE){
        SERIAL_DEBUG(" !BuffLocked");  
        return;
      }
      sem_lock_tempReceivePayloadBuffer = SEM_BUFF_WRITING;
      memcpy(tempReceivePayloadBuffer, payload, len) ;
      tempReceivePayloadBuffer[len] = '\0';
      sem_lock_tempReceivePayloadBuffer = SEM_BUFF_AWAITPROCESS;
      //SERIAL_DEBUG(payload);
    }else if (strcmp(topic, actor_topic) == 0){
      handleActorMsg(payload, len);      
    }
  }
}


void onMqttConnect(bool sessionPresent) {
  SERIAL_DEBUG("MQTT connected");
  f_subscribe = true;
  f_SendConfigReport = true;
  RST_MQTT_CONN_ERROR;
  BLINK_STOP;
}


void writeOnlineState(){
    //overwrite the offline status that might have been set by the last will  
  if (mqttClient.publish(sensor_topic, 1, true, "ONLINE") == 0){
    Serial.println("Cannot publish online state");
    INCR_MQTT_CONN_ERROR;
    ENABLE_MQTT_CHECK_TIMER;
  };
}

void onMqttDisconnect(AsyncMqttClientDisconnectReason reason) {
  BLINK_ERROR;
  Serial.print("MQTT disconnect: ");
  INCR_MQTT_CONN_ERROR;
  Serial.print((int) reason);
  Serial.print(" CNT ");
  Serial.println((int) cnt_mqtt_connectionerror);  
}

void onMqttSubscribe(uint16_t packetId, uint8_t qos) {
  SERIAL_DEBUG("Sub ACK");
  RST_MQTT_CONN_ERROR;
}

void onMqttUnsubscribe(uint16_t packetId) {
  SERIAL_DEBUG("Unsub ACK");  
}

void onMqttPublish(uint16_t packetId) {
  SERIAL_DEBUG("Pub ACK");
  RST_MQTT_CONN_ERROR;
}

void getStoreConnstring(){
  STOP_GET_CONFIG_CONNSTR;
  if (state_autoconfig_mode == AUTOCONF_GET_CONFIG_PROGRESS){ // a connection is unfinished
    return;
  };

    char connstr_url[64];
    sprintf(connstr_url, "/connstr/%s", str_mac);  

    IPAddress host = WiFi.gatewayIP();
    Serial.print("[HTTP] begin..");
    if (http.begin(host.toString(), 80, connstr_url)) {  // HTTP
      state_autoconfig_mode = AUTOCONF_GET_CONFIG_PROGRESS;
      Serial.print(" GET ");
      Serial.println(connstr_url);
      // start connection and send HTTP header
      int httpCode = http.GET();

      // httpCode will be negative on error
      if (httpCode > 0) {
        // HTTP header has been send and Server response header has been handled
        Serial.printf(" code: %d\n", httpCode);

        // file found at server
        if (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY) {
        // get lenght of document (is -1 when Server sends no Content-Length header)
          int len = http.getSize();

          // create buffer for read
          uint8_t buff[128] = { 0 };

          // get tcp stream
          WiFiClient * stream = &http.getStream();

            // read all data from server
            while (http.connected() && (len > 0 || len == -1)) {
              // get available data size
              size_t size = stream->available();

              if (size) {
                // read up to 128 byte
                int c = stream->readBytes(buff, ((size > sizeof(buff)) ? sizeof(buff) : size));
                // write it to Serial
                if (len > 0) {len -= c;}
              }
              delay(1);
            }
            
          int iret = command_set_conn_params((char*) buff, stream);
          if (iret == 0){
            state_autoconfig_mode = AUTOCONF_CONFIG_STORED;
          //confirm
            http.PUT("OK"); 
          }else{
            http.PUT("Settings store error"); 
          }
        }else{
          state_autoconfig_mode = AUTOCONF_GET_CONFIG_ERROR;
      //send confirmation
      
            int httpCode = http.PUT("ERR");
        }
        
      } else {
        Serial.printf(" error: %s\n", http.errorToString(httpCode).c_str());
        state_autoconfig_mode = AUTOCONF_GET_CONFIG_ERROR;
      }      
      //http.end();
      yield();      
      
      http.end();

    } else {
      Serial.printf("[HTTP] Unable to connect\n");
      state_autoconfig_mode = AUTOCONF_GET_CONFIG_ERROR;
    }    

