spaxxomatic/esp8266_iot_node/src/mqtt_sensor_actor.cpp
}

void setup(void) {
  Serial.begin(115200);
  Serial.setTimeout(1000);
  Serial.println();
  Serial.println("Boot..");
  pinMode(LED_BUILTIN, OUTPUT);
  pinMode(LED_FLASH, OUTPUT);
  // flip the pin every 0.3s
  BLINK_STARTING;
  
  #ifdef HAS_MOTION_SENSOR
  attachInterrupt(digitalPinToInterrupt(MOTION_SENSOR_PIN), motion_sensor_irq, FALLING);
  #endif
  byte mac[6];
  WiFi.macAddress(mac);
  sprintf(str_mac,"%02x%02x%02x%02x%02x%02x",mac[0],mac[1],mac[2], mac[3], mac[4], mac[5]  );
  sprintf(actor_topic, "/actor/%s", str_mac);
  sprintf(config_topic, "/config/%s", str_mac);
  
  sprintf(sensor_topic, "/sensor/%s", str_mac);
  sprintf(report_topic, "/report/%s", str_mac);
  Serial.println(str_mac);

  SERIAL_DEBUGC("Flash size") ;
  SERIAL_DEBUGC(ESP.getFlashChipRealSize()) ;
  SERIAL_DEBUGC(" Free: ") ;
  SERIAL_DEBUG(ESP.getFreeSketchSpace());
  //set up timer
  os_timer_setfn(&ioHandlerTimer, ioTimerCallback, NULL);
  os_timer_arm(&ioHandlerTimer, OS_MAIN_TIMER_MS, true);
  
  EepromConfig.begin();
    
  http.setReuse(true);
  wifiConnectHandler = WiFi.onStationModeGotIP(onWifiConnect);
  
  if (EepromConfig.readEepromParams()){ //if we have saved params, try to connect the wlan
 
  Serial.print("MQTT srv parms");
  Serial.print(EepromConfig.settings.mqtt_server);
  Serial.print(EepromConfig.settings.mqtt_username);
  Serial.print(EepromConfig.settings.mqtt_password);
  
  WiFi.hostByName(EepromConfig.settings.mqtt_server, mqttServerIp) ;
  WiFi.onStationModeDisconnected(onWifiDisconnect);

  mqttClient.setServer(mqttServerIp, 1883);  
  mqttClient.setCredentials(EepromConfig.settings.mqtt_username, EepromConfig.settings.mqtt_password);
  mqttClient.onConnect(onMqttConnect);
  mqttClient.onDisconnect(onMqttDisconnect);
  mqttClient.onSubscribe(onMqttSubscribe);
  mqttClient.onMessage(onMqttMessage);
  mqttClient.setKeepAlive(10).setCleanSession(true).setClientId(str_mac)
    .setWill(sensor_topic, 0, true, "OFFLINE");;
         
  } else {
    state_autoconfig_mode = AUTOCONF_START ;
  }

  ESP.wdtEnable(5000);
  pinMode(ACTOR_PIN, OUTPUT);
  #ifdef HAS_BUTTON
  pinMode(BUTTON_PIN, INPUT_PULLUP);
  #endif
  
  START_WIFI_CONNCHECK_TIMER;
  BLINK_STOP;  
  //enable PWM on led pin
  analogWriteFreq(100); // Hz freq
  timer_heartbeat.attach(EepromConfig.settings.log_freq, timer_heartbeat_handler);
  
 }

volatile bool f_wifi_conn_in_progress = false;
int cnt_wlan_connectionerror = 0;
#define INCR_WLAN_CONN_ERR_AND_RETURN cnt_wlan_connectionerror++; f_wifi_conn_in_progress = false; return ;
#define RST_WLAN_CONN_ERR cnt_wlan_connectionerror = 0;


void connectToWifi(){
  
  if (f_wifi_conn_in_progress) {
    Serial.print ("Wifi conn in progress");
    return;  
  }

  if (WiFi.status() == WL_CONNECTED){
      Serial.print ("Already connected");
      return;
  }

  char* ssid = EepromConfig.settings.ssid;
  char* passwd =  EepromConfig.settings.password;
  
  Serial.println ("Ck Wi-Fi ");

  f_wifi_conn_in_progress = true;

  if (state_autoconfig_mode >= AUTOCONF_START){    
    ssid = WIFI_AP_CONFIG;
    passwd = WIFI_AP_CONFIG_PW;
  }  
  
  Serial.print (" Wi-Fi ");
  Serial.print (ssid);
  Serial.println (passwd);
  WiFi.persistent(false);
  WiFi.mode(WIFI_STA);
  WiFi.setSleepMode(WIFI_NONE_SLEEP);  
  WiFi.setAutoReconnect(false);  
  wl_status_t status = WiFi.begin(ssid, passwd) ;
  if (status == WL_CONNECT_FAILED){
    Serial.println ("Conn failed");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  };
  if (status == STATION_CONNECT_FAIL){
    Serial.println ("Conn fail");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  }; 
  if (status == STATION_IDLE){
    Serial.println ("err idle");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  };    
  if (WiFi.status() == WL_DISCONNECTED){
    //WL_DISCONNECTED means usually that credentials are not valid
    Serial.println ("CW disconnected");
    INCR_WLAN_CONN_ERR_AND_RETURN;
  }

  f_wifi_conn_in_progress = false;

}

void onWifiConnect(const WiFiEventStationModeGotIP& event)
{
  STOP_WIFI_CONNCHECK_TIMER;
  #ifdef DEBUG
    Serial.println("Connected to Wi-Fi.");
    Serial.println(WiFi.localIP());
  #endif
  #ifdef DEBUG
    Serial.println("Connecting to MQTT...");
  #endif    
  WiFi.onStationModeDisconnected(onWifiDisconnect);
  //only make conn persistent if we're not in config mode
  if (state_autoconfig_mode == AUTOCONF_DISABLED){      
    //if we reached this place, we're connected
    ENABLE_MQTT_CHECK_TIMER;
    Serial.print("Connected. IP: ");
    WiFi.persistent(true);
  }else{
    Serial.print("Autoconf wifi connected ");
    state_autoconfig_mode = AUTOCONF_WIFI_CONNECTED;
  }
  Serial.println(WiFi.localIP());  
}

// ----------------------------------------------------------------------

void onWifiDisconnect(const WiFiEventStationModeDisconnected& event)
{
  BLINK_ERROR;    
  Serial.print("Lost Wi-Fi ");
  Serial.print(event.ssid);
  Serial.print(" ");
  Serial.println (event.reason);
  
  DISABLE_MQTT_CHECK_TIMER;
  
  if (WiFi.status() == WL_CONNECTED) { // handles wrong state report
    Serial.println("Status is wrong, disconnect");
    resetWiFi();
  } 
  
  START_WIFI_CONNCHECK_TIMER;
}

const char jsonFormatBattOnly[] = "{\"batt\":%s}";
const char jsonFormatErr[] = "{\"error\":\"%s\"}";
const char jsonFormatReport[] = "{\"fw\":\"%d\",\"location\":\"%s\",\"cap\":\"%s\", \"lasterr\":\"%s\"}";

float batt_voltage=0.00f;
char tbuff[8];
char hbuff[8];
char bvbuff[8];

void sendHeartbeat(){
  //batt_voltage = ESP.getVcc()/(float)1000;
  //snprintf(tempTopicBuffer, sizeof(tempTopicBuffer), "%s/data", sensor_topic);
  //sprintf(tempSendPayloadBuffer,jsonFormatBattOnly, dtostrf(batt_voltage, 6, 2, bvbuff));
  //if (mqttClient.publish(tempTopicBuffer, 1, true, tempSendPayloadBuffer) == 0){
  //   SERIAL_DEBUGC("\n MQTT err send.") ;
  //};
  SERIAL_DEBUG("Sending HB") ;  
  writeOnlineState();
}

void mqtt_check_conn(){ //retry reconnect should be called periodically by the chk_connect timer 
    SERIAL_DEBUG("MQTT CKCON") ;   
    if (!mqttClient.connected()){    
        mqttClient.disconnect(true);
        SERIAL_DEBUG("MQTT reconnect ..") ;
        yield();  
        mqttClient.connect();
    }
}

void loop_serial(){
  check_serial_cmd(); //serial command avail?
  yield();
}

void loop_autoconf_state(){
  switch (state_autoconfig_mode){
    case AUTOCONF_START:
    case  AUTOCONF_CONNECT_WIFI :
      enterConfigWifi(); break;
    case AUTOCONF_WIFI_CONNECTED:
      state_autoconfig_mode = AUTOCONF_GET_CONFIG;
    case AUTOCONF_GET_CONFIG:
      getStoreConnstring(); break;
    case AUTOCONF_GET_CONFIG_PROGRESS: break;
      //just wait 
    case AUTOCONF_GET_CONFIG_ERROR: 
      // if there was an error, retrigger it
      TRIGGER_GET_CONFIG_CONNSTR; break;      
    case AUTOCONF_CONFIG_STORED:       
      esp_bugfree_restart(); break;
      
