spaxxomatic/esp8266_iot_node/src/mqtt_sensor_actor.cpp
    default: break;
  } 
  yield();
}

void loop_connstack(){
    /* ----------- Communication handlinng -------------*/
  if (f_mqtt_reconnect){ 
      f_mqtt_reconnect = false;
      mqtt_check_conn();
    }
  yield();
}

void loop_mqtt(){
  if (sendActorState){
    sendActorState = false;
    snprintf(tempTopicBuffer, sizeof(tempTopicBuffer), "%s/state", actor_topic);
    itoa(EepromConfig.settings.actor_state,tempSendPayloadBuffer,10);
    if (mqttClient.publish(tempTopicBuffer, 1, true, tempSendPayloadBuffer) == 0){
      SERIAL_DEBUG("MQTT pub failed") ;
      BLINK_ERROR;      
    }else{
      BLINK_STOP;
    };  
    yield();
  }
  if (bSendHeartbeat){
      bSendHeartbeat = false;
      sendHeartbeat();
      yield();
  }  
  if (f_subscribe){
      f_subscribe = false;
      handleSubscribe();
      yield();
  }  
  if (sem_lock_tempReceivePayloadBuffer == SEM_BUFF_AWAITPROCESS){    
      //we received a config message, process it async    
      handleConfigMsg();
      sem_lock_tempReceivePayloadBuffer = SEM_BUFF_FREE;      
      yield();
  }    
  if (f_deleteRemoteConfig){
      f_deleteRemoteConfig = false;
      mqttClient.publish(config_topic, 1, false);
      yield();
  }  
  if (f_SendConfigReport){
      f_SendConfigReport = false;  
      char lasterr[EEPARAM_LASTERR_LEN] ;
      EepromConfig.get_lasterr(lasterr);
      lasterr[EEPARAM_LASTERR_LEN-1] = '\0'; //buffer overflow protection
      sprintf(tempSendPayloadBuffer,jsonFormatReport, FW_VERSION, EepromConfig.settings.location, CAPABILITIES, lasterr);
      mqttClient.publish(report_topic, 1, true, tempSendPayloadBuffer);
      yield();
  }

}

void loop_hw_io(){
  //inputs handling
  if (ioHandlerTick){
    ioHandlerTick = false;
    //we read the button state only once every tick, (debouncing)
    #ifdef HAS_BUTTON
    uint8_t val = digitalRead(BUTTON_PIN);  // read input value
     if (val == HIGH) {  //check if the input is HIGH (button released)
       iButtonState = 0;
     } else {
       iButtonState += 1; //increment, but only the value 1 will trigger an action
     }
     if (iButtonState == 1){
       //only the first press after a depress shall trigger a state change
       actor_toggle();
     }
     if (iButtonState >= 20){ // around 20*0.2 seconds 
       //4 presses - enter wifi manager
       Serial.println("BP->Enter config");
       if (state_autoconfig_mode == AUTOCONF_DISABLED || state_autoconfig_mode == AUTOCONF_GET_CONFIG_ERROR){
        command_enter_config(nullptr);
       }
     }     
    #endif
    
    if (!blinker.active()){
      /* show normal operation by dimming the LED up and down */  
      pwmval+=pwmdir;
      analogWrite(LED_BUILTIN, pwmval);
      if (pwmval >=980) pwmdir = -50;
      if (pwmval <= 40) pwmdir = 50;
    }    
  }
}


void handleSubscribe(){  
  writeOnlineState();
  mqttClient.subscribe(actor_topic, 2);  
  mqttClient.subscribe(config_topic, 2);    
}

bool handleConfigMsg(){
    if (sem_lock_tempReceivePayloadBuffer == SEM_BUFF_WRITING){
      SERIAL_DEBUG ("! bufflock");  
      SERIAL_DEBUG (tempReceivePayloadBuffer);
      return false;
    }
    sem_lock_tempReceivePayloadBuffer = SEM_BUFF_READING;
    SERIAL_DEBUG ("HCM");
    SERIAL_DEBUG (tempReceivePayloadBuffer);
    JsonObject& jsonRoot = jsonBuffer.parseObject(tempReceivePayloadBuffer); 
    // Test if parsing succeeds.
    if (!jsonRoot.success()) {
        SERIAL_DEBUG("Payld parse fail");        
    }else{    
        int deepsleep = jsonRoot["deepsleep"];
        if (deepsleep > 0){
            EepromConfig.store_deepsleep(deepsleep);
            SERIAL_DEBUGC ("Deepsleep value set to ");
            SERIAL_DEBUG (deepsleep);
        }
        const char*  location = jsonRoot["location"];
        //root.prettyPrintTo(Serial);
        if (location){
          SERIAL_DEBUG ("Set location");
          EepromConfig.store_location(location);
          //delete config and delete it
        }
        int log_freq = jsonRoot["log_freq"];
        if (log_freq){
          SERIAL_DEBUGC ("Set log_freq");
          SERIAL_DEBUG (log_freq);
          if (log_freq > 0){
            EepromConfig.store_log_freq(log_freq);
            timer_heartbeat.detach();
            timer_heartbeat.attach(EepromConfig.settings.log_freq, timer_heartbeat_handler);
          }else{
            SERIAL_DEBUG ("No freq value");
          }
        }
        int report = jsonRoot["report"];
        if (report){
          f_SendConfigReport = true;
        }  
        uint16_t update_firmware_version = jsonRoot["update"];
        if (update_firmware_version){
          SERIAL_DEBUGC ("Set update FW ");
          command_trigger_update(update_firmware_version);
        }                
        
        #ifdef HAS_MOTION_SENSOR
        int val = jsonRoot["motion_sensor_timer"];
        if (val){
          SERIAL_DEBUGC ("Set motion_sensor_timer: ");
          SERIAL_DEBUG (val);
          if (val >= MOTION_SENSOR_DEFAULT_TIMER){
            EepromConfig.storeMotionSensorOffTimer(val);
          }else{
            SERIAL_DEBUG ("Invalid mot sensor timer val");
          }
        }
        #endif
        //f_deleteRemoteConfig = true;
    }    
    jsonBuffer.clear();    
    return true;    
}

void handleActorMsg(char* payload, int length){
  SERIAL_DEBUG ("H_AM");  
  if (length > 0){
    if (payload[0] == '0'){
      actor_off();
      sensorMode = MODE_SENSOR_ENABLED;
    }else{
      if (payload[0] == MODE_SENSOR_DISABLED) { //this is a special value for "permanent on"
        sensorMode = MODE_SENSOR_DISABLED;
        SERIAL_DEBUG ("sensor dis");
        actor_on(true);
      }else{
        SERIAL_DEBUG ("sensor en");
        sensorMode = MODE_SENSOR_ENABLED;
        actor_on(false);
      }
    }
  }

}

void loop(void) {
  yield();
  //delay(50);
  loop_hw_io();
  loop_serial();
  if (state_autoconfig_mode > AUTOCONF_DISABLED){
    //we are in autoconf mode, handle only the autoconf loop
    loop_autoconf_state();
  }else{
    loop_mqtt();
    loop_connstack();  
  }
}

void command_reset	(char* params){
		Serial.println("Reset");
    mqttClient.disconnect(true);
    delay(400);
		WiFi.disconnect();
    delay(400);
    esp_bugfree_restart();
    delay(100);
}

void command_enter_config	(char* params){
		Serial.println("Enter conf");
    mqttClient.disconnect(true);
		WiFi.disconnect();
    state_autoconfig_mode = AUTOCONF_START;
}